const stolu = prompt('Введіть число від 1 до 100...')
const n = stolu;
if (n == 1) {
    console.log(stolu + ' cтіл')
}
if (n >= 2 && n <= 4 || n >= 22 && n <= 24 || n >= 32 && n <= 34 || n >= 42 && n <= 44 || n >= 52 && n <= 54 || n >= 62 && n <= 64 || n >= 72 && n <= 74 || n >= 82 && n <= 84 || n >= 92 && n <= 94) {
    console.log(stolu + ' стола')
}
if (n == 21 || n == 31 || n == 41 || n == 51 || n == 61 || n == 71 || n == 81 || n == 91) {
    console.log(stolu + ' стіл')
}
if (n >= 5 && n <= 20 || n >= 25 && n <= 30 || n >= 35 && n <= 40 || n >= 45 && n <= 50 || n >= 55 && n <= 60 || n >= 65 && n <= 70 || n >= 75 && n <= 80 || n >= 85 && n <= 90 || n >= 95 && n <= 99) {
    console.log(stolu + ' столів')
}
if (n > 100 || n<0) {
    console.log('так неможна')
}